In [1]:
!which python

/Users/alaa.bakhti/miniconda3/envs/recsys_students/bin/python

In [2]:
!python --version

Python 3.8.5

In [4]:
!tree ../

../
├── data
│   └── movielens
│       ├── ml-latest
│       │   ├── README.txt
│       │   ├── genome-scores.csv
│       │   ├── genome-tags.csv
│       │   ├── links.csv
│       │   ├── movies.csv
│       │   ├── ratings.csv
│       │   └── tags.csv
│       └── ml-latest-small
│           ├── README.txt
│           ├── links.csv
│           ├── movies.csv
│           ├── ratings.csv
│           └── tags.csv
├── notebooks
│   └── eda_movielens.ipynb
└── requirements.txt

5 directories, 14 files

In [5]:
from pathlib import Path
import pandas as pd

In [6]:
DATA_DIR = Path('../data/movielens/ml-latest')

RATINGS_FILEPATH = DATA_DIR / 'ratings.csv'
MOVIES_FILPATH = DATA_DIR / 'movies.csv'

# Ratings

In [7]:
ratings_raw = pd.read_csv(RATINGS_FILEPATH)
ratings_raw.sample(5)

          userId  movieId  rating   timestamp
16872490  172497     1247     4.5  1440205415
4747511    48678    46976     3.0  1218560216
17072248  174422    49272     4.0  1237934015
3844184    39611      968     3.5  1131811431
11330871  116429    30810     5.0  1139878328

In [8]:
ratings = ratings_raw.copy()

In [9]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27753444 entries, 0 to 27753443
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 847.0 MB

In [10]:
ratings.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [11]:
ratings.duplicated(keep=False).sum()

0

# Movies

In [12]:
movies_raw = pd.read_csv(MOVIES_FILPATH)
movies_raw.sample(5)

,movieId,title,genres
11079,45728,Clerks II (2006),Comedy
28921,126076,How They Get There (1997),(no genres listed)
46373,167632,"Raging Sun, Raging Sky (2009)",Drama|Fantasy
24161,112614,Eye of the Cat (1969),Horror
46676,168278,Science Fiction Volume One: The Osiris Child,Sci-Fi

In [13]:
movies = movies_raw.copy()

In [14]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58098 entries, 0 to 58097
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  58098 non-null  int64
 1   title    58098 non-null  object
 2   genres   58098 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.3+ MB

In [15]:
movies.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [16]:
movies.duplicated().sum()

0

**Title + genre**

In [17]:
movies.duplicated(subset=['title', 'genres']).sum()

14

In [18]:
duplicates = movies[movies.duplicated(subset=['title', 'genres'], keep=False)]
duplicates

       movieId                        title                   genres
2560      2644               Dracula (1931)                   Horror
11173    46865            Little Man (2006)                   Comedy
11412    48682               Offside (2006)             Comedy|Drama
13504    66511        Berlin Calling (2008)             Comedy|Drama
14038    70155  Seven Years Bad Luck (1921)                   Comedy
15637    79254                  Home (2008)                    Drama
15902    80330               Offside (2006)             Comedy|Drama
18867    93279               Darling (2007)                    Drama
19914    97773             Girl, The (2012)                    Drama
20835   101212             Girl, The (2012)                    Drama
21655   104035               Beneath (2013)                   Horror
21691   104155         Clear History (2013)                   Comedy
23834   111519        Johnny Express (2014)  Animation|Comedy|Sci-Fi
25046   115777               Beneath (2013)                   Horror
27572   122940         Clear History (2013)                   Comedy
29852   128991        Johnny Express (2014)  Animation|Comedy|Sci-Fi
30226   130062               Darling (2007)                    Drama
33001   136564               Macbeth (2015)                    Drama
36172   143978                  Home (2008)                    Drama
38804   150310               Macbeth (2015)                    Drama
44387   163246  Seven Years Bad Luck (1921)                   Comedy
46904   168774                Detour (2017)                 Thriller
48620   172427            Little Man (2006)                   Comedy
51339   178401                 Lucky (2017)                    Drama
52192   180205               Dracula (1931)                   Horror
52644   181329                 Lucky (2017)                    Drama
52795   181655                Detour (2017)                 Thriller
57269   191775        Berlin Calling (2008)             Comedy|Drama

In [19]:
duplicates.title.values

array(['Dracula (1931)', 'Little Man (2006)', 'Offside (2006)',
       'Berlin Calling (2008)', 'Seven Years Bad Luck (1921)',
       'Home (2008)', 'Offside (2006)', 'Darling (2007)',
       'Girl, The (2012)', 'Girl, The (2012)', 'Beneath (2013)',
       'Clear History (2013)', 'Johnny Express (2014)', 'Beneath (2013)',
       'Clear History (2013)', 'Johnny Express (2014)', 'Darling (2007)',
       'Macbeth (2015)', 'Home (2008)', 'Macbeth (2015)',
       'Seven Years Bad Luck (1921)', 'Detour (2017)',
       'Little Man (2006)', 'Lucky (2017)', 'Dracula (1931)',
       'Lucky (2017)', 'Detour (2017)', 'Berlin Calling (2008)'],
      dtype=object)

In [20]:
for movie_title in duplicates.title.unique():
    display(movies[movies.title == movie_title])

       movieId           title  genres
2560      2644  Dracula (1931)  Horror
52192   180205  Dracula (1931)  Horror

       movieId              title  genres
11173    46865  Little Man (2006)  Comedy
48620   172427  Little Man (2006)  Comedy

       movieId           title        genres
11412    48682  Offside (2006)  Comedy|Drama
15902    80330  Offside (2006)  Comedy|Drama

       movieId                  title        genres
13504    66511  Berlin Calling (2008)  Comedy|Drama
57269   191775  Berlin Calling (2008)  Comedy|Drama

       movieId                        title  genres
14038    70155  Seven Years Bad Luck (1921)  Comedy
44387   163246  Seven Years Bad Luck (1921)  Comedy

       movieId        title genres
15637    79254  Home (2008)  Drama
36172   143978  Home (2008)  Drama

       movieId           title genres
18867    93279  Darling (2007)  Drama
30226   130062  Darling (2007)  Drama

       movieId             title genres
19914    97773  Girl, The (2012)  Drama
20835   101212  Girl, The (2012)  Drama

       movieId           title  genres
21655   104035  Beneath (2013)  Horror
25046   115777  Beneath (2013)  Horror

       movieId                 title  genres
21691   104155  Clear History (2013)  Comedy
27572   122940  Clear History (2013)  Comedy

       movieId                  title                   genres
23834   111519  Johnny Express (2014)  Animation|Comedy|Sci-Fi
29852   128991  Johnny Express (2014)  Animation|Comedy|Sci-Fi

       movieId           title genres
33001   136564  Macbeth (2015)  Drama
38804   150310  Macbeth (2015)  Drama

       movieId          title    genres
46904   168774  Detour (2017)  Thriller
52795   181655  Detour (2017)  Thriller

       movieId         title genres
51339   178401  Lucky (2017)  Drama
52644   181329  Lucky (2017)  Drama

In [21]:
nb_ratings_to_drop = 0
for movie_id in duplicates.movieId.values:
    nb_ratings_to_drop += (ratings.movieId == movie_id).sum()
nb_ratings_to_drop

3762

**Title**

In [22]:
movies.title.duplicated().sum()

78

In [23]:
movies[movies.title.duplicated(keep=False)]

,movieId,title,genres
582,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
823,838,Emma (1996),Comedy|Drama|Romance
1716,1788,Men with Guns (1997),Action|Drama
2560,2644,Dracula (1931),Horror
2766,2851,Saturn 3 (1980),Adventure|Sci-Fi|Thriller
...,...,...,...
57269,191775,Berlin Calling (2008),Comedy|Drama
57305,191867,Let There Be Light (2017),Documentary
57361,192003,Journey to the Center of the Earth (2008),Action|Adventure|Fantasy|Sci-Fi
57463,192243,Contact (1992),Drama|Horror|Mystery|Thriller
57953,193559,Cargo (2017),Drama

In [24]:
movies[movies.title == 'Berlin Calling (2008)']

       movieId                  title        genres
13504    66511  Berlin Calling (2008)  Comedy|Drama
57269   191775  Berlin Calling (2008)  Comedy|Drama